[
  {
    "key": "nodistractions",
    "title": "No Distractions",
    "date": "May 2020 - Present",
    "technologies": "",
    "description": "A Firefox browser extension that temporarily blocks distracting websites to allow users focus.",
    "responsibilities": "",
    "timeEnd": ""
  },
  {
    "key": "degreeinsight",
    "title": "DegreeInsight.io",
    "date": "Aug. 2019 - May 2020",
    "technologies": "TypeScript, Angular, Material, Adobe XD, HTML, CSS, Agile",
    "description": "A web application that lets students plan course roadmaps toward their graduation.",
    "responsibilities": [
      "Collaborated with a team of senior university students to develop a web application that helps students plan out when to take courses in order to graduate in time.",
      "Deliberated with teammates to identify needed technologies to formulate thetech stack to be used.",
      "Designed UI/UX mockups and prototypes to provide visual representation during development.",
      "Architected and implemented responsive front-end UI interfaces for various feature specs such as student profile and term planning dashboard."
    ]
  },
  {
    "key": "spartanagenda",
    "title": "Spartan Agenda",
    "date": "Spring 2020",
    "technologies": "Java, Spring Boot, MySQL, JavaScript, React, HTML, CSS, Docker",
    "description": "A web application lets user create to-do lists to organize their tasks.",
    "responsibilities": [
      "Engineered RESTful APIs and utilized JSON Web Tokens and Spring Security to secure them.",
      "Programmed a user authentication API complete with salting/hashing of passwords and credentials validation"
    ]
  },
  {
    "key": "abode",
    "title": "Abode.city",
    "date": "Spring 2019",
    "technologies": "JavaScript, React, Redux, NodeJS, MongoDB, Express, Material UI, HTML, CSS, Agile",
    "description": "A web application that simulates a hotel booking app.",
    "responsibilities": [
      "Developed a web application that simulates a hotel booking website with a team of fellow engineering students.",
      "Drafted UI mockups for the landing page, hotel search page, and city description pages.",
      "Built the front-end for the hotel search and city description feature specs complete with search result filtering and page responsiveness."
    ]
  },
  {
    "key": "bytedrive",
    "title": "Byte Drive",
    "date": "Spring 2019",
    "technologies": "iOS, Swift, XCode, Firebase",
    "description": "An iOS app that lets users store files and images in the cloud.",
    "responsibilities": ""
  },
  {
    "key": "textencryptor",
    "title": "Text Encryptor",
    "date": "Spring 2019",
    "technologies": "",
    "description": "A web application that encrypts or decrypts text files and input.",
    "responsibilities": ""
  },
  {
    "key": "spartanstop",
    "title": "Spartanstop.com",
    "date": "Fall 2018",
    "technologies": "JavaScript, React, Redux, NodeJS, MongoDB, Express, Bootstrap, HTML, CSS, Agile",
    "description": "A web application that simulates an e-commerce app.",
    "responsibilities": [
      "Built the front-end of the search products by category and food recipes features.",
      "Implemented the corresponding back-end support for the food recipes featurewhich queriesand servesdata from a MongoDB instance."
    ]
  }
]
